[
  {
    "title": "Chiliz Chain",
    "url": "https://github.com/chiliz-chain/v2",
    "thumbnail": "/assets/img/chiliz-chain-thumb.png",
    "subtitle": "L1 chain built for sports",
    "description": "Chiliz Chain is an EVM layer 1, PoSA chain with on-chain governance.",
    "myRole": "I worked on maintaining and improving the system's smart contracts, and the Dragon8 hard fork.",
    "stack": "Go, Solidity, Javascript, Docker",
    "company": "Chiliz",
    "achievements": "The chain processes over 50k transactions daily."
  },
  {
    "title": "Chiliz Chain Governance dApp",
    "url": "https://governance.chilizchain.com/",
    "thumbnail": "/assets/img/chiliz-chain-thumb.png",
    "subtitle": "Governance & staking UI",
    "description": "The dApp provides an easy-to-use UI that lets users stake or unstake their CHZ on the validators, track and claim their staking rewards, and participate in on-chain voting.",
    "myRole": "I designed and built the back end that indexes the blockchain and provides a REST API for the front end. I also occasionally worked on the front-end components.",
    "stack": "Typescript, Nodejs, PostgreSQL, React, Docker",
    "company": "Chiliz",
    "achievements": null
  },
  {
    "title": "Chiliz Bridge",
    "url": "https://bridge.chiliz.com/transfer",
    "thumbnail": "/assets/img/chiliz-chain-thumb.png",
    "subtitle": "Bridge between Chiliz Chain <-> Ethereum",
    "description": "Chiliz Bridge is a two-way bridge that allows users to transfer their CHZ between the Chiliz Chain and Ethereum networks.",
    "myRole": "I improved the bridge relayer software and smart contracts by adding support for ERC20 to native currency transfers and for EIP-1559.",
    "stack": "Go, Solidity, Typescript, Nodejs, React, Docker",
    "company": "Chiliz",
    "achievements": null
  },
  {
    "title": "Paybitx",
    "url": "https://paybitx.com",
    "thumbnail": "/assets/img/paybitx-thumb.png",
    "subtitle": "Crypto bank with custodial web wallet, simple REST API and invoice generator for ecommerce merchants.",
    "description": "Built as a competitor to CoinPayments.net, it provides a clean abstraction over multiple blockchain networks and enables its users to seamlessly send and receive payments, as well as generate invoices in over 15 cryptocurrencies through its web UI or REST API. It's perfect for individuals or businesses who want to transact in crypto without extra hassle.",
    "myRole": "I was responsible for everything related to the back end. I designed and built a suite of services for monitoring and processing transactions in Bitcoin, Ethereum, Ripple, Stellar, and ERC tokens (including Tether, Uniswap, LINK, USD Coin, VeChain, Binance USD, chiliZ, Synthetix Network Token, EnjinCoin, Maker, ZRX, OmiseGO, and Shiba Inu), generating and processing invoices for all available currencies, managing user authentication, and developing the gateway REST API.",
    "stack": "Javascript, NodeJs, PostgreSQL, Docker, k8s",
    "company": "Biznetx",
    "achievements": null
  },
  {
    "title": "Crypto Billing System",
    "url": "",
    "thumbnail": null,
    "subtitle": "Web application for monitoring & processing crypto payments.",
    "description": "An internal app that allowed us at Biznetx to process crypto payments across multiple providers such as Paybitx and CoinPayments.net. The app provided a simple web UI where managers could view all incoming and outgoing transactions, including those that failed or got stuck, and manually reconcile them from the UI if needed.",
    "stack": "Javascript, NodeJs, PostgreSQL, Docker, k8s",
    "company": "Biznetx",
    "myRole": "I was responsible for building and maintaining the app. I designed and built the back end in JavaScript and the front end in EJS, regularly interacted with managers to discuss requirements across different project teams, provided documentation, and handled urgent incidents in production.",
    "achievements": null
  },
  {
    "title": "Wenu",
    "url": "https://wenu.io",
    "thumbnail": "/assets/img/wenu-thumb.png",
    "subtitle": "Ordering made simple",
    "description": "Wenu is a suite of mobile and web applications that helps restaurants digitize their interaction with customers by providing digital menus that customers can interact with by scanning a QR code at the table, adding items to their cart, and ordering and paying with their debit or credit card. The platform gained the most traction during the COVID pandemic, as reusable paper menus were banned for a few months in Georgia.",
    "stack": "Javascript, NodeJs, PHP, PostgreSQL, Docker",
    "company": "Biznetx",
    "myRole": "I was primarily responsible for the back end but occasionally worked on some front-end components. I also provided documentation to front-end and mobile developers and handled urgent incidents in production.",
    "achievements": "The project won 100,000 ₾ in GITA's Startup Matching Grants Program and was chosen by the USAID Economic Security Program to receive tailored assistance from a top global accelerator in Silicon Valley. By the time I left Biznetx, Wenu was being used by 5 restaurants and more than 3.5k users."
  },
  {
    "title": "Agronavti",
    "url": "https://play.google.com/store/apps/details?id=ge.org.gfa.gfa",
    "thumbnail": "/assets/img/agronavti-thumb.png",
    "subtitle": "Mobile app for farmers",
    "description": "Agronavti is a mobile app that allows Georgian farmers to obtain news and various information to aid planning and managing their farming business.",
    "stack": "HTML, CSS, PHP, MariaDB",
    "company": "Biznetx",
    "myRole": "I was responsible for maintaining and improving the back end, as well as providing API reference and documentation to mobile app developers.",
    "achievements": "The app had over 4k active users. Unfortunately, it looks like the project got abandoned."
  },
  {
    "title": "Vintage",
    "url": "https://evintage.io",
    "thumbnail": "/assets/img/vintage-thumb.png",
    "subtitle": "P2P location based digital flea market",
    "description": "Vintage was a mobile app that allowed people to buy and sell items. The app's main feature was the ability to sort items by distance, so users would see only items available in the local market.",
    "stack": "Javascript, NodeJs, MariaDB, React Native",
    "company": "Biznetx",
    "myRole": "I was primarily responsible for everything related to the back end but occasionally worked on the front end as well. I also provided documentation to front-end developers and handled urgent incidents in production",
    "achievements": "By the time I left Biznetx, the app had over 40k registered users. Unfortunately, the project got discontinued."
  },
  {
    "title": "Eldocs.net",
    "url": "https://eldocs.net",
    "thumbnail": "/assets/img/eldocs-thumb.png",
    "subtitle": "Project management app for NGOs",
    "description": "Eldocs.net is a web application for Georgian NGOs where they can create & track projects.",
    "stack": "Javascript, NodeJs, MariaDB, React",
    "company": "Biznetx",
    "myRole": "I was primarily responsible for everything related to the back end but occasionally worked on the front end as well. I also provided documentation to front-end developers and handled urgent incidents in production",
    "achievements": "By the time I left Biznetx, we had onboarded 1 NGO."
  },
  {
    "title": "Eth-price",
    "url": "https://eth-price.com",
    "thumbnail": "/assets/img/eth-price-thumb.png",
    "subtitle": "Cryptocurrency dashboard with realtime statistics",
    "description": "A simple dashboard where users could see real-time price data for 150+ cryptocurrencies. The data was aggregated from multiple sources such as CoinMarketCap, CoinGecko, and centralized exchanges like Poloniex and Binance.",
    "stack": "Javascript, NodeJs, MongoDB, React, Socket.io",
    "company": "Biznetx",
    "myRole": "I was primarily responsible for everything related to the back end. I also implemented server-side rendering for our React front end to improve SEO. Unfortunately, we dropped the project because we didn't have enough resources to keep it running, and it didn't generate revenue.",
    "achievements": null
  },
  {
    "title": "Tbilisi B&RF",
    "url": "https://play.google.com/store/apps/details?id=com.tbrf",
    "thumbnail": "/assets/img/tbilisibrf-thumb.png",
    "subtitle": "Mobile app for Tbilisi B&RF participants",
    "description": "Tbilisi B&RF was an app made specifically for the Tbilisi B&RF event. It allowed forum participants to chat or book meetings with each other, view the agenda, and explore interesting locations within the city where they could hold business meetings or just relax.",
    "stack": "Javascript, NodeJs, MongoDB, React Native, Socket.io",
    "company": "Biznetx",
    "myRole": "I designed and implemented the chat module of the app. (Back end + React Native Front end)"
  }
]
